INSERT INTO interactivemap_post VALUES
	(1, 'Разработчик'),
	(2, 'Разработчик Flex'),
	(3, 'Тестировщик'),
	(4, 'Скрам-мастер'),
	(5, 'Технический писатель'),
	(6, 'Эксперт'),
	(7, 'Маркетолог'),
	(8, 'Тренер');
	
INSERT INTO interactivemap_division VALUES
	(1, 'Отдел разработки');
	
INSERT INTO interactivemap_subdivision VALUES
	(1, 'Команда экспертов', 1),
	(2, 'Команда A', 1),
	(3, 'Команда B', 1),
	(4, 'Команда E', 1),
	(5, 'Архитектурная команда', 1);
	
INSERT INTO interactivemap_floor VALUES
	(1, 4, 'maps/floor04.svg', 'Walls'),
	(2, 6, 'maps/floor06.svg', 'Walls');
	
INSERT INTO interactivemap_room VALUES
	(1, 'Левая комната', null, null, 'LeftRoom', 1),
	(2, 'Коридор', null, null, 'Corridor', 1),
	(3, 'Неизведанное', null, null, 'CenterCurvedRoom', 1),
	(4, 'Помещение', null, null, 'Room', 1),
	(5, 'Комната ожидания', null, null, 'polygon3515', 1),
	(6, 'Правая комната', null, null, 'RightRoom', 1),
	
	(7, 'Пуфик-рум', null, null, 'LeftLowerRoom', 2),
	(8, 'Та, что рядом с кухней', null, null, 'LeftUpperRoom', 2),
	(9, 'Загончик для девелоперов', null, null, 'RightRoom', 2);
	
INSERT INTO interactivemap_employee VALUES
	(1, 'Иванов', 'Иван', 'Иванович', 'i.ivanov@example.com', '+7 921 123 45 67', '89602561212', null, 'g222', null, null, 1, 8, 1),
	(2, 'Иванов', 'Иван', 'Иванович', 'i.ivanov@example.com', '+7 921 123 45 67', '89602561212', null, 'g246', null, null, 1, 8, 1),
	(3, 'Иванов', 'Иван', 'Иванович', 'i.ivanov@example.com', '+7 921 123 45 67', '89602561212', null, 'g234', null, null, 1, 8, 1),
	(4, 'Иванов', 'Иван', 'Иванович', 'i.ivanov@example.com', '+7 921 123 45 67', '89602561212', null, 'g402', null, null, 1, 8, 1),
	(5, 'Иванов', 'Иван', 'Иванович', 'i.ivanov@example.com', '+7 921 123 45 67', '89602561212', null, 'g390', null, null, 1, 8, 1),
	(6, 'Иванов', 'Иван', 'Иванович', 'i.ivanov@example.com', '+7 921 123 45 67', '89602561212', null, 'g474', null, null, 1, 8, 1),
	
	(7, 'Иванов', 'Иван', 'Иванович', 'i.ivanov@example.com', '+7 921 123 45 67', '89602561212', null, 'g66', null, null, 1, 9, 1),
	(8, 'Иванов', 'Иван', 'Иванович', 'i.ivanov@example.com', '+7 921 123 45 67', '89602561212', null, 'g450', null, null, 1, 9, 1),
	(9, 'Иванов', 'Иван', 'Иванович', 'i.ivanov@example.com', '+7 921 123 45 67', '89602561212', null, 'g186', null, null, 1, 9, 1),
	(10, 'Иванов', 'Иван', 'Иванович', 'i.ivanov@example.com', '+7 921 123 45 67', '89602561212', null, 'g546', null, null, 1, 9, 1),
	(11, 'Иванов', 'Иван', 'Иванович', 'i.ivanov@example.com', '+7 921 123 45 67', '89602561212', null, 'g54', null, null, 1, 9, 1),
	(12, 'Иванов', 'Иван', 'Иванович', 'i.ivanov@example.com', '+7 921 123 45 67', '89602561212', null, 'g198', null, null, 1, 9, 1),
	(13, 'Иванов', 'Иван', 'Иванович', 'i.ivanov@example.com', '+7 921 123 45 67', '89602561212', null, 'g174', null, null, 1, 9, 1),
	(14, 'Иванов', 'Иван', 'Иванович', 'i.ivanov@example.com', '+7 921 123 45 67', '89602561212', null, 'g522', null, null, 1, 9, 1),
	
	(15, 'Иванов', 'Иван', 'Иванович', 'i.ivanov@example.com', '+7 921 123 45 67', '89602561212', null, 'g582', null, null, 1, 9, 1),
	(16, 'Иванов', 'Иван', 'Иванович', 'i.ivanov@example.com', '+7 921 123 45 67', '89602561212', null, 'g354', null, null, 1, 9, 1),
	(17, 'Иванов', 'Иван', 'Иванович', 'i.ivanov@example.com', '+7 921 123 45 67', '89602561212', null, 'g498', null, null, 1, 9, 1),
	(18, 'Иванов', 'Иван', 'Иванович', 'i.ivanov@example.com', '+7 921 123 45 67', '89602561212', null, 'g438', null, null, 1, 9, 1),
	(19, 'Иванов', 'Иван', 'Иванович', 'i.ivanov@example.com', '+7 921 123 45 67', '89602561212', null, 'g570', null, null, 1, 9, 1),
	(20, 'Иванов', 'Иван', 'Иванович', 'i.ivanov@example.com', '+7 921 123 45 67', '89602561212', null, 'g534', null, null, 1, 9, 1),
	(21, 'Иванов', 'Иван', 'Иванович', 'i.ivanov@example.com', '+7 921 123 45 67', '89602561212', null, 'g210', null, null, 1, 9, 1),
	(22, 'Иванов', 'Иван', 'Иванович', 'i.ivanov@example.com', '+7 921 123 45 67', '89602561212', null, 'g462', null, null, 1, 9, 1),
	
	(23, 'Иванов', 'Иван', 'Иванович', 'i.ivanov@example.com', '+7 921 123 45 67', '89602561212', null, 'g342', null, null, 1, 9, 1),
	(24, 'Иванов', 'Иван', 'Иванович', 'i.ivanov@example.com', '+7 921 123 45 67', '89602561212', null, 'g330', null, null, 1, 9, 1),
	(25, 'Иванов', 'Иван', 'Иванович', 'i.ivanov@example.com', '+7 921 123 45 67', '89602561212', null, 'g486', null, null, 1, 9, 1),
	(26, 'Иванов', 'Иван', 'Иванович', 'i.ivanov@example.com', '+7 921 123 45 67', '89602561212', null, 'g510', null, null, 1, 9, 1),
	(27, 'Иванов', 'Иван', 'Иванович', 'i.ivanov@example.com', '+7 921 123 45 67', '89602561212', null, 'g426', null, null, 1, 9, 1),
	(28, 'Иванов', 'Иван', 'Иванович', 'i.ivanov@example.com', '+7 921 123 45 67', '89602561212', null, 'g414', null, null, 1, 9, 1),
	(29, 'Иванов', 'Иван', 'Иванович', 'i.ivanov@example.com', '+7 921 123 45 67', '89602561212', null, 'g306', null, null, 1, 9, 1),
	(30, 'Иванов', 'Иван', 'Иванович', 'i.ivanov@example.com', '+7 921 123 45 67', '89602561212', null, 'g282', null, null, 1, 9, 1),
	
	(31, 'Иванов', 'Иван', 'Иванович', 'i.ivanov@example.com', '+7 921 123 45 67', '89602561212', null, 'g114', null, null, 1, 9, 1),
	(32, 'Иванов', 'Иван', 'Иванович', 'i.ivanov@example.com', '+7 921 123 45 67', '89602561212', null, 'g378', null, null, 1, 9, 1),
	(33, 'Иванов', 'Иван', 'Иванович', 'i.ivanov@example.com', '+7 921 123 45 67', '89602561212', null, 'g90', null, null, 1, 9, 1),
	(34, 'Иванов', 'Иван', 'Иванович', 'i.ivanov@example.com', '+7 921 123 45 67', '89602561212', null, 'g258', null, null, 1, 9, 1),
	
	(35, 'Иванов', 'Иван', 'Иванович', 'i.ivanov@example.com', '+7 921 123 45 67', '89602561212', null, 'g366', null, null, 1, 9, 1),
	(36, 'Иванов', 'Иван', 'Иванович', 'i.ivanov@example.com', '+7 921 123 45 67', '89602561212', null, 'g318', null, null, 1, 9, 1),
	(37, 'Иванов', 'Иван', 'Иванович', 'i.ivanov@example.com', '+7 921 123 45 67', '89602561212', null, 'g270', null, null, 1, 9, 1),
	(38, 'Иванов', 'Иван', 'Иванович', 'i.ivanov@example.com', '+7 921 123 45 67', '89602561212', null, 'g294', null, null, 1, 9, 1),
	
	(39, 'Иванов', 'Иван', 'Иванович', 'i.ivanov@example.com', '+7 921 123 45 67', '89602561212', null, 'g78', null, null, 1, 9, 1),
	(40, 'Иванов', 'Иван', 'Иванович', 'i.ivanov@example.com', '+7 921 123 45 67', '89602561212', null, 'g102', null, null, 1, 9, 1),
	
	(41, 'Иванов', 'Иван', 'Иванович', 'i.ivanov@example.com', '+7 921 123 45 67', '89602561212', null, 'g162', null, null, 1, 9, 1),
	(42, 'Иванов', 'Иван', 'Иванович', 'i.ivanov@example.com', '+7 921 123 45 67', '89602561212', null, 'g126', null, null, 1, 9, 1),
	(43, 'Иванов', 'Иван', 'Иванович', 'i.ivanov@example.com', '+7 921 123 45 67', '89602561212', null, 'g138', null, null, 1, 9, 1),
	(44, 'Иванов', 'Иван', 'Иванович', 'i.ivanov@example.com', '+7 921 123 45 67', '89602561212', null, 'g150', null, null, 1, 9, 1),
	
	(45, 'Иванов', 'Иван', 'Иванович', 'i.ivanov@example.com', '+7 921 123 45 67', '89602561212', null, 'g558', null, null, 1, 9, 1),
	
	
	(46, 'Иванов', 'Иван', 'Иванович', 'i.ivanov@example.com', '+7 921 123 45 67', '89602561212', null, 'g3872', null, null, 1, 1, 1),
	(47, 'Иванов', 'Иван', 'Иванович', 'i.ivanov@example.com', '+7 921 123 45 67', '89602561212', null, 'g3896', null, null, 1, 1, 1),
	(48, 'Иванов', 'Иван', 'Иванович', 'i.ivanov@example.com', '+7 921 123 45 67', '89602561212', null, 'g3638', null, null, 1, 1, 1),
	(49, 'Иванов', 'Иван', 'Иванович', 'i.ivanov@example.com', '+7 921 123 45 67', '89602561212', null, 'g3644', null, null, 1, 1, 1),
	(50, 'Иванов', 'Иван', 'Иванович', 'i.ivanov@example.com', '+7 921 123 45 67', '89602561212', null, 'g3570', null, null, 1, 1, 1),
	(51, 'Иванов', 'Иван', 'Иванович', 'i.ivanov@example.com', '+7 921 123 45 67', '89602561212', null, 'g3564', null, null, 1, 1, 1),
	(52, 'Иванов', 'Иван', 'Иванович', 'i.ivanov@example.com', '+7 921 123 45 67', '89602561212', null, 'g3656', null, null, 1, 1, 1),
	(53, 'Иванов', 'Иван', 'Иванович', 'i.ivanov@example.com', '+7 921 123 45 67', '89602561212', null, 'g3650', null, null, 1, 1, 1),
	(54, 'Иванов', 'Иван', 'Иванович', 'i.ivanov@example.com', '+7 921 123 45 67', '89602561212', null, 'g3626', null, null, 1, 1, 1),
	(55, 'Иванов', 'Иван', 'Иванович', 'i.ivanov@example.com', '+7 921 123 45 67', '89602561212', null, 'g3614', null, null, 1, 1, 1),
	(56, 'Иванов', 'Иван', 'Иванович', 'i.ivanov@example.com', '+7 921 123 45 67', '89602561212', null, 'g3620', null, null, 1, 1, 1),
	(57, 'Иванов', 'Иван', 'Иванович', 'i.ivanov@example.com', '+7 921 123 45 67', '89602561212', null, 'g3602', null, null, 1, 1, 1),
	(58, 'Иванов', 'Иван', 'Иванович', 'i.ivanov@example.com', '+7 921 123 45 67', '89602561212', null, 'g3884', null, null, 1, 1, 1),
	(59, 'Иванов', 'Иван', 'Иванович', 'i.ivanov@example.com', '+7 921 123 45 67', '89602561212', null, 'g3674', null, null, 1, 1, 1),
	(60, 'Иванов', 'Иван', 'Иванович', 'i.ivanov@example.com', '+7 921 123 45 67', '89602561212', null, 'g3764', null, null, 1, 1, 1),
	(61, 'Иванов', 'Иван', 'Иванович', 'i.ivanov@example.com', '+7 921 123 45 67', '89602561212', null, 'g3710', null, null, 1, 1, 1),
	(62, 'Иванов', 'Иван', 'Иванович', 'i.ivanov@example.com', '+7 921 123 45 67', '89602561212', null, 'g3842', null, null, 1, 1, 1),
	(63, 'Иванов', 'Иван', 'Иванович', 'i.ivanov@example.com', '+7 921 123 45 67', '89602561212', null, 'g3716', null, null, 1, 1, 1),
	(64, 'Иванов', 'Иван', 'Иванович', 'i.ivanov@example.com', '+7 921 123 45 67', '89602561212', null, 'g3722', null, null, 1, 1, 1),
	(65, 'Иванов', 'Иван', 'Иванович', 'i.ivanov@example.com', '+7 921 123 45 67', '89602561212', null, 'g3770', null, null, 1, 1, 1),
	(66, 'Иванов', 'Иван', 'Иванович', 'i.ivanov@example.com', '+7 921 123 45 67', '89602561212', null, 'g3778', null, null, 1, 1, 1),
	(67, 'Иванов', 'Иван', 'Иванович', 'i.ivanov@example.com', '+7 921 123 45 67', '89602561212', null, 'g3820', null, null, 1, 1, 1),
	(68, 'Иванов', 'Иван', 'Иванович', 'i.ivanov@example.com', '+7 921 123 45 67', '89602561212', null, 'g3828', null, null, 1, 1, 1),
	(69, 'Иванов', 'Иван', 'Иванович', 'i.ivanov@example.com', '+7 921 123 45 67', '89602561212', null, 'g3800', null, null, 1, 1, 1),
	(70, 'Иванов', 'Иван', 'Иванович', 'i.ivanov@example.com', '+7 921 123 45 67', '89602561212', null, 'g3792', null, null, 1, 1, 1),
	
	(71, 'Иванов', 'Иван', 'Иванович', 'i.ivanov@example.com', '+7 921 123 45 67', '89602561212', null, 'g3854', null, null, 1, 6, 1),
	(72, 'Иванов', 'Иван', 'Иванович', 'i.ivanov@example.com', '+7 921 123 45 67', '89602561212', null, 'g3668', null, null, 1, 6, 1),
	(73, 'Иванов', 'Иван', 'Иванович', 'i.ivanov@example.com', '+7 921 123 45 67', '89602561212', null, 'g3596', null, null, 1, 6, 1),
	(74, 'Иванов', 'Иван', 'Иванович', 'i.ivanov@example.com', '+7 921 123 45 67', '89602561212', null, 'g3890', null, null, 1, 6, 1),
	(75, 'Иванов', 'Иван', 'Иванович', 'i.ivanov@example.com', '+7 921 123 45 67', '89602561212', null, 'g3814', null, null, 1, 6, 1),
	(76, 'Иванов', 'Иван', 'Иванович', 'i.ivanov@example.com', '+7 921 123 45 67', '89602561212', null, 'g3878', null, null, 1, 6, 1),
	(77, 'Иванов', 'Иван', 'Иванович', 'i.ivanov@example.com', '+7 921 123 45 67', '89602561212', null, 'g3608', null, null, 1, 6, 1),
	(78, 'Иванов', 'Иван', 'Иванович', 'i.ivanov@example.com', '+7 921 123 45 67', '89602561212', null, 'g3680', null, null, 1, 6, 1),
	(79, 'Иванов', 'Иван', 'Иванович', 'i.ivanov@example.com', '+7 921 123 45 67', '89602561212', null, 'g3836', null, null, 1, 6, 1),
	(80, 'Иванов', 'Иван', 'Иванович', 'i.ivanov@example.com', '+7 921 123 45 67', '89602561212', null, 'g3686', null, null, 1, 6, 1),
	(81, 'Иванов', 'Иван', 'Иванович', 'i.ivanov@example.com', '+7 921 123 45 67', '89602561212', null, 'g3698', null, null, 1, 6, 1),
	(82, 'Иванов', 'Иван', 'Иванович', 'i.ivanov@example.com', '+7 921 123 45 67', '89602561212', null, 'g3752', null, null, 1, 6, 1),
	(83, 'Иванов', 'Иван', 'Иванович', 'i.ivanov@example.com', '+7 921 123 45 67', '89602561212', null, 'g3692', null, null, 1, 6, 1),
	(84, 'Иванов', 'Иван', 'Иванович', 'i.ivanov@example.com', '+7 921 123 45 67', '89602561212', null, 'g3590', null, null, 1, 6, 1),
	(85, 'Иванов', 'Иван', 'Иванович', 'i.ivanov@example.com', '+7 921 123 45 67', '89602561212', null, 'g3584', null, null, 1, 6, 1),
	(86, 'Иванов', 'Иван', 'Иванович', 'i.ivanov@example.com', '+7 921 123 45 67', '89602561212', null, 'g3786', null, null, 1, 6, 1),
	(87, 'Иванов', 'Иван', 'Иванович', 'i.ivanov@example.com', '+7 921 123 45 67', '89602561212', null, 'g3662', null, null, 1, 6, 1),
	(88, 'Иванов', 'Иван', 'Иванович', 'i.ivanov@example.com', '+7 921 123 45 67', '89602561212', null, 'g3808', null, null, 1, 6, 1),
	(89, 'Иванов', 'Иван', 'Иванович', 'i.ivanov@example.com', '+7 921 123 45 67', '89602561212', null, 'g3728', null, null, 1, 6, 1),
	(90, 'Иванов', 'Иван', 'Иванович', 'i.ivanov@example.com', '+7 921 123 45 67', '89602561212', null, 'g3704', null, null, 1, 6, 1),
	(91, 'Иванов', 'Иван', 'Иванович', 'i.ivanov@example.com', '+7 921 123 45 67', '89602561212', null, 'g3758', null, null, 1, 6, 1),
	(92, 'Иванов', 'Иван', 'Иванович', 'i.ivanov@example.com', '+7 921 123 45 67', '89602561212', null, 'g3860', null, null, 1, 6, 1),
	(93, 'Иванов', 'Иван', 'Иванович', 'i.ivanov@example.com', '+7 921 123 45 67', '89602561212', null, 'g3848', null, null, 1, 6, 1),
	(94, 'Иванов', 'Иван', 'Иванович', 'i.ivanov@example.com', '+7 921 123 45 67', '89602561212', null, 'g3866', null, null, 1, 6, 1),
	(95, 'Иванов', 'Иван', 'Иванович', 'i.ivanov@example.com', '+7 921 123 45 67', '89602561212', null, 'g3552', null, null, 1, 6, 1),
	(96, 'Иванов', 'Иван', 'Иванович', 'i.ivanov@example.com', '+7 921 123 45 67', '89602561212', null, 'g3546', null, null, 1, 6, 1),
	(97, 'Иванов', 'Иван', 'Иванович', 'i.ivanov@example.com', '+7 921 123 45 67', '89602561212', null, 'g3558', null, null, 1, 6, 1),
	(98, 'Иванов', 'Иван', 'Иванович', 'i.ivanov@example.com', '+7 921 123 45 67', '89602561212', null, 'g3632', null, null, 1, 6, 1);
	
